[
  {
    "job_title": "Junior Frontend Developer",
    "company_name": "PT. HTC Global Software Services",
    "location": "Jakarta Raya",
    "employement": "Kontrak",
    "salary": "Rp 5.000.000 – Rp 6.000.000 per month",
    "job_description": "Key Responsibilities:Develop and maintain user-facing features for web applications.Ensure the technical feasibility of UI/UX designs.Write clean, maintainable, and efficient code.Optimize applications for maximum speed and scalability.Collaborate with backend developers to integrate APIs and other services.Debug and resolve technical issues.Participate in code reviews and provide constructive feedback.Stay updated with emerging trends and technologies in frontend development.Qualifications:Bachelor’s degree in Computer Science, Design, or a related field.1-3 years of experience with Javascript Framework (preferably Vue, but React & Angular is acceptable).Proficiency in HTML, CSS, and JavaScript.Experience wit UI Collaboration using Figma.Basic knowledge of web performance optimization techniques.Strong problem-solving skills and attention to detail.Ability to work collaboratively in a team environment.Willing to work in Banking is a must"
  },
  {
    "job_title": "Frontend Developer",
    "company_name": "PT Sapta Tunas Teknologi",
    "location": "Jakarta Raya",
    "employement": "Full time",
    "salary": 0,
    "job_description": "Qualification: - Minimum of 2 years inf frontend web development- Proficient in Typescript, Javascript, CSS, and HTML- Familiar with Vue.js, Gif, Webpack/Vite, API implementation and intergration- Able to create responsive web designs compatible with various devices and browsers- Understanding of frontend testing (Unit testing and end-to-end testing) Responsibilities:- Develop and maintain responsive and efficient web user interfaces- Collaborate with the backend team to integrate APIs and ensure optimal data synchronization- Optimize application for speed and scalability "
  },
  {
    "job_title": "Front-End Programmer",
    "company_name": "PT Pulau Sambu",
    "location": "Jakarta Utara, Jakarta Raya",
    "employement": "Full time",
    "salary": "Rp 6.000.000 – Rp 9.000.000 per month",
    "job_description": "Deskripsi Kerja:Menerima permintaan pembuatan, penyesuaian, ataupun perbaikan aplikasi.Mendapatkan, memahami, dan mendiskusikan informasi analisa dan desain aplikasi yang akan dan sedang dikerjakan secara baik, lengkap, dan jelas.Mengembangkan, memodifikasi, mengintegrasikan, mengimplementasikan, menguji, dan memelihara aplikasi dari sisi front-end.Membuat dan mengubah kode program sesuai standar dan pengaturan departemen, menggunakan model proses pembuatan dan pengembangan perangkat lunak yang diterapkan Departemen IT.Membuat aplikasi sesuai perintah atasan, dengan mengikuti desain dan rencana yang dibuat oleh tim Development.Melakukan debugging untuk mengidentifikasi dan memperbaiki bug atau masalah.Melakukan continuous improvement, mengoptimalkan kinerja aplikasi, dan meningkatkan efisiensi kode.Menerapkan praktik keamanan terbaik untuk melindungi data dan sistem.Membuat technical documentation dan panduan user.Bekerja sama dengan tim untuk membangun aplikasi.Menjaga keamanan dan kerahasiaan data pada komputer, software, dan server.Melakukan monitoring dan pemeliharaan rutin untuk memastikan aplikasi/service tetap berjalan dengan baik.Membuat dokumentasi pengembangan aplikasi dan laporan kegiatan rutin. Kualifikasi:Latar belakang pendidikan minimal D3/S1 Teknik Informatika/Computer Science/sejenisnya.Berpengalaman minimal 1 tahun sebagai Front-End Developer.Kemampuan desain UI/UX yang estetik dan intuitif.Menguasai PHP, HTML, dan CSS.Menguasai JavaScript (Angular/React/dan lainnya).Kemampuan dalam desain yang responsif dan kompatibel lintas perangkat atau browser.Menguasai pemrograman mobile menjadi nilai tambah.Terbiasa dengan version control tools seperti GitHub.Kemampuan pemecahan masalah yang baik dan analisa kritis.Mampu berkomunikasi dan bekerja sama, baik dengan rekan setim maupun atasan.Mampu bekerja secara indivisu maupun kelompok.Mampu mendokumentasi dan menulis laporan dengan baik."
  },
  {
    "job_title": "Front-end React Developer (Full Remote)",
    "company_name": "DevStack",
    "location": "Bandung, Jawa Barat",
    "employement": "Full time",
    "salary": "Rp 12.000.000 – Rp 17.000.000 per month",
    "job_description": "Key ResponsibilitiesDevelop and maintain user-facing features using React.Build reusable components and front-end libraries for future use.Translate designs and wireframes into high-quality code.Optimize components for maximum performance across a vast array of web-capable devices and browsers.Collaborate with designers, back-end developers, and other team members to deliver high-quality products.Stay updated with emerging trends and technologies in front-end development.Conduct code reviews and provide constructive feedback to team members.Ensure the technical feasibility of UI/UX designs.Technical RequirementsSpeak fluent English.Minimum 3 years of relevant experience in front-end development.Strong proficiency in JavaScript, including DOM manipulation and JS object model.Strong understanding of React and its core principles.Experience with popular React workflows (such as Flux or Redux).Familiarity with RESTful APIs.Knowledge of modern authorization mechanisms, such as JSON Web Token.Experience with front-end build pipelines and tools.Ability to understand business requirements and translate them into technical requirements.Proficient in version control with Git.Excellent problem-solving skills and attention to detail.Strong communication and collaboration skills.Before applying, please make sure to update your CV in English and make it clear about your experience and tech stack you have experience with.Only shortlisted candidates who qualified based on the requirement above will be contacted for further process."
  },
  {
    "job_title": "Front End Developer",
    "company_name": "PT. Metrodata Electronics, Tbk",
    "location": "Jakarta Barat, Jakarta Raya",
    "employement": "Kontrak",
    "salary": 0,
    "job_description": "We are looking for an experienced Front End Developer to join our team. If you have excellent programming skills and a passion for developing applications or improving existing ones, we would like to meet you. As a Front End Developer, you’ll work closely with our engineers to ensure system consistency and improve user experience.     Front End Developer roles and responsibilities include:  ·  Design, Develop, Analyze, troubleshooting related Front End Development.·  Collaborate with Back End Developer.·  Involved in all aspects of the development life cycle, including development, Testing, UAT, deployment, warranty and post-warranty bug fixes.·  Conduct analysis and problem solving of application accuracy, application dependency, reporting and technical function.   PT Metrodata Electronics, Tbk (Digital Solution Provider & Technology Innovator) would like to invite you to be part of the company to develop yourself and your skills. If you are: Bachelor's Degree,Computer Science/Information Technology At least 2 year(s) of working experience as Front End DeveloperExperienced in PHP, ReactJS, NextJSExcellent analytical and problem solving skills.If you meet the requirement we needed, let’s apply for the following open positions. Metrodata not just offer for the job, we offer you for brighter career future.    "
  },
  {
    "job_title": "Frontend Developer Chapter Lead / Tech Lead",
    "company_name": "PT Astra International - Toyota Sales Operation (Auto2000)",
    "location": "Frontend Developer Chapter Lead / Tech LeadPT Astra International - Toyota Sales Operation (Auto2000)4.5120 ulasan·Lihat semua lowongan kerjaJakarta Raya",
    "employement": "Full time",
    "salary": 0,
    "job_description": "\n\nDesain Arsitektur:\nMerancang dan merancang solusi frontend yang memenuhi persyaratan produk, kebutuhan skalabilitas, dan sasaran kinerja.\nMenetapkan dan menegakkan standar pengodean, praktik terbaik, dan prinsip arsitektur untuk pengembangan frontend.\nMengevaluasi dan memilih teknologi, kerangka kerja, dan pustaka frontend yang sesuai untuk digunakan dalam proyek. \n\n\nKepemimpinan Teknis:\nMemberikan kepemimpinan dan bimbingan teknis kepada pengembang frontend.\nMembimbing anggota tim, membantu mereka mengembangkan keterampilan dan keahlian teknis mereka.\nMelakukan tinjauan kode, memastikan kepatuhan terhadap pedoman dan standar arsitektur.\nBerkolaborasi dengan tim lintas fungsi untuk mendorong keputusan dan solusi teknis. \n\n\nPengembangan Frontend:\nMemimpin pengembangan fitur dan komponen frontend yang kompleks.\nMenulis kode frontend berkualitas tinggi, dapat dipelihara, dan efisien.\nMengoptimalkan kinerja frontend dan pengalaman pengguna. \nMemecahkan masalah dan men-debug masalah dan bug frontend. \n\n\nTooling dan Infrastruktur:\nMenyiapkan dan memelihara perkakas pengembangan frontend, membangun jalur pipa, dan infrastruktur. \nMenerapkan dan mengotomatiskan proses pengujian, penerapan, dan pemantauan frontend. \nMengevaluasi dan merekomendasikan perkakas dan teknologi untuk meningkatkan alur kerja dan produktivitas pengembangan frontend. \n\n\nDokumentasi dan Knowledge Sharing:\nMendokumentasikan desain, keputusan, dan pola arsitektur.\nMembuat dan memelihara dokumentasi teknis untuk sistem dan komponen frontend. \nMelakukan sesi berbagi pengetahuan dan lokakarya untuk mentransfer keahlian kepada anggota tim lainnya. \n\n\nOptimalisasi Kinerja:\nMengidentifikasi dan mengatasi hambatan kinerja dalam aplikasi frontend. \nMengoptimalkan kode, aset, dan sumber daya frontend untuk meningkatkan waktu pemuatan halaman dan kinerja rendering. \nMenerapkan strategi caching, lazy loading, dan teknik pengoptimalan lainnya. \n\n\nRiset dan Inovasi:\nTetap terinformasi tentang teknologi frontend yang sedang berkembang, tren, dan perkembangan industri.\nMelakukan riset dan eksperimen untuk mengeksplorasi teknologi, kerangka kerja, dan alat frontend baru. \nMenguji coba dan mengevaluasi teknologi frontend baru untuk menilai kelayakan dan potensi manfaatnya. \n\n\nPeningkatan Berkelanjutan:\nMengevaluasi dan meningkatkan proses pengembangan frontend, alur kerja, dan metodologi secara terus-menerus. \nMengidentifikasi area yang perlu ditingkatkan dan menerapkan inisiatif untuk meningkatkan kualitas, efisiensi, dan inovasi frontend.\n\n\n\n\n\nGelar Sarjana dari jurusan Teknik Informatika/Sistem Informasi/Teknik Komputer/Manajemen Informatika atau bidang terkait dari universitas terkemuka dengan IPK minimal 3,00.\n\n9+ tahun pengalaman dalam OO JavaScript dan kerangka kerja Front-end khususnya. \nBerpengalaman dalam mengembangkan aplikasi menggunakan Javascript, ReactJS, VueJS, NodeJS, HTML5 CSS3/CSS4 dan teknologi UI lainnya. \nBerpengalaman dalam membangun aplikasi PWA yang kaya. \nMemahami dan berpengalaman dengan pemrosesan asinkron, penyegaran halaman parsial, traversal DOM, dan manipulasi. \nBerpengalaman dengan konstruksi, dokumentasi, dan arsitektur REST API, termasuk bahasa deskripsi API seperti Swagger. \nBerpengalaman dalam penguraian dan manipulasi XML dan JSON. \nPemahaman mendalam tentang pola JavaScript dan tantangan yang terlibat dalam menciptakan aplikasi JavaScript yang dapat dipelihara. \nBerpengalaman mengembangkan UI multi-saluran, responsif seluler, dan adaptif seluler. \nBerpengalaman dengan alat Front-end untuk pengujian dan otomatisasi, seperti Gulp, Mocha, Karma, Chai, dan selenium. \nBerpengalaman membangun sistem dan situs berkinerja tinggi berskala besar. \nMemiliki pandangan yang baik untuk detail UI yang subtle. \nBerpengalaman bekerja dalam pengembangan yang digerakkan oleh pengujian yang gesit dengan integrasi berkelanjutan. \nKeterampilan komunikasi yang sangat baik\n\n\n\n\n\nDesain Arsitektur:\nMerancang dan merancang solusi frontend yang memenuhi persyaratan produk, kebutuhan skalabilitas, dan sasaran kinerja.\nMenetapkan dan menegakkan standar pengodean, praktik terbaik, dan prinsip arsitektur untuk pengembangan frontend.\nMengevaluasi dan memilih teknologi, kerangka kerja, dan pustaka frontend yang sesuai untuk digunakan dalam proyek. \n\n\nKepemimpinan Teknis:\nMemberikan kepemimpinan dan bimbingan teknis kepada pengembang frontend.\nMembimbing anggota tim, membantu mereka mengembangkan keterampilan dan keahlian teknis mereka.\nMelakukan tinjauan kode, memastikan kepatuhan terhadap pedoman dan standar arsitektur.\nBerkolaborasi dengan tim lintas fungsi untuk mendorong keputusan dan solusi teknis. \n\n\nPengembangan Frontend:\nMemimpin pengembangan fitur dan komponen frontend yang kompleks.\nMenulis kode frontend berkualitas tinggi, dapat dipelihara, dan efisien.\nMengoptimalkan kinerja frontend dan pengalaman pengguna. \nMemecahkan masalah dan men-debug masalah dan bug frontend. \n\n\nTooling dan Infrastruktur:\nMenyiapkan dan memelihara perkakas pengembangan frontend, membangun jalur pipa, dan infrastruktur. \nMenerapkan dan mengotomatiskan proses pengujian, penerapan, dan pemantauan frontend. \nMengevaluasi dan merekomendasikan perkakas dan teknologi untuk meningkatkan alur kerja dan produktivitas pengembangan frontend. \n\n\nDokumentasi dan Knowledge Sharing:\nMendokumentasikan desain, keputusan, dan pola arsitektur.\nMembuat dan memelihara dokumentasi teknis untuk sistem dan komponen frontend. \nMelakukan sesi berbagi pengetahuan dan lokakarya untuk mentransfer keahlian kepada anggota tim lainnya. \n\n\nOptimalisasi Kinerja:\nMengidentifikasi dan mengatasi hambatan kinerja dalam aplikasi frontend. \nMengoptimalkan kode, aset, dan sumber daya frontend untuk meningkatkan waktu pemuatan halaman dan kinerja rendering. \nMenerapkan strategi caching, lazy loading, dan teknik pengoptimalan lainnya. \n\n\nRiset dan Inovasi:\nTetap terinformasi tentang teknologi frontend yang sedang berkembang, tren, dan perkembangan industri.\nMelakukan riset dan eksperimen untuk mengeksplorasi teknologi, kerangka kerja, dan alat frontend baru. \nMenguji coba dan mengevaluasi teknologi frontend baru untuk menilai kelayakan dan potensi manfaatnya. \n\n\nPeningkatan Berkelanjutan:\nMengevaluasi dan meningkatkan proses pengembangan frontend, alur kerja, dan metodologi secara terus-menerus. \nMengidentifikasi area yang perlu ditingkatkan dan menerapkan inisiatif untuk meningkatkan kualitas, efisiensi, dan inovasi frontend.\n\n\n\n\n\nGelar Sarjana dari jurusan Teknik Informatika/Sistem Informasi/Teknik Komputer/Manajemen Informatika atau bidang terkait dari universitas terkemuka dengan IPK minimal 3,00.\n\n9+ tahun pengalaman dalam OO JavaScript dan kerangka kerja Front-end khususnya. \nBerpengalaman dalam mengembangkan aplikasi menggunakan Javascript, ReactJS, VueJS, NodeJS, HTML5 CSS3/CSS4 dan teknologi UI lainnya. \nBerpengalaman dalam membangun aplikasi PWA yang kaya. \nMemahami dan berpengalaman dengan pemrosesan asinkron, penyegaran halaman parsial, traversal DOM, dan manipulasi. \nBerpengalaman dengan konstruksi, dokumentasi, dan arsitektur REST API, termasuk bahasa deskripsi API seperti Swagger. \nBerpengalaman dalam penguraian dan manipulasi XML dan JSON. \nPemahaman mendalam tentang pola JavaScript dan tantangan yang terlibat dalam menciptakan aplikasi JavaScript yang dapat dipelihara. \nBerpengalaman mengembangkan UI multi-saluran, responsif seluler, dan adaptif seluler. \nBerpengalaman dengan alat Front-end untuk pengujian dan otomatisasi, seperti Gulp, Mocha, Karma, Chai, dan selenium. \nBerpengalaman membangun sistem dan situs berkinerja tinggi berskala besar. \nMemiliki pandangan yang baik untuk detail UI yang subtle. \nBerpengalaman bekerja dalam pengembangan yang digerakkan oleh pengujian yang gesit dengan integrasi berkelanjutan. \nKeterampilan komunikasi yang sangat baik\n\n\n"
  },
  {
    "job_title": "Fullstack Developer (Internship)",
    "company_name": "PT Phincon",
    "location": "Jakarta Selatan, Jakarta Raya",
    "employement": "Kontrak",
    "salary": 0,
    "job_description": "Requirement :Candidate must possess at least Bachelor's Degree in Computer Science/Information Technology or equivalent.Familiar with JavaScript framework such as JQuery, Angular, ReactJS, Node JS, Golang, Node JSFamiliar and have skills at coding: HTML, HTML5, CSS, CSS3, Word Press, Code Igniter, MySql, RubyFamiliar with designer tools such as: Adobe Photoshop, Corel Draw, etc Job Description :Build Application for MyTelkomsel MicroServices dan APIWeb developer is responsible for implementing visual and interactive elements that users engage with through their web browser when using a web applicationDevelop functional and appealing web- and mobile-based applications based on usability "
  },
  {
    "job_title": "Web Specialist",
    "company_name": "PT JOENOES IKAMULYA",
    "location": "Jakarta Timur, Jakarta Raya",
    "employement": "Full time",
    "salary": 0,
    "job_description": "Kami sedang mencari seorang WordPress Developer yang memiliki kemampuan untuk mengembangkan website berbasis WordPress yang ramah perangkat seluler, cepat, dan aman, baik dari segi front-end maupun back-end. Posisi ini memerlukan kombinasi keterampilan dalam PHP, HTML5, CSS3, dan JavaScript. Selain itu, pemahaman yang kuat tentang seluruh proses pengembangan web, mulai dari desain hingga deployment, menjadi prioritas.Job Responsibilities:Mendesign website perusahaan yang interaktif dan responsif di berbagai platform.Memastikan kecepatan akses situs web berbasis WordPress optimal.Membuat konsep user experience dan interaksi dengan menggunakan metode wireframing dan rapid prototyping.Menganalisa fitur dan design dan melakukan pemeliharaan website dan konten website.Memastikan situs web berbasis WordPress mematuhi standar aksesibilitas web.Melakukan pengambilan data dan menganalisa trafik yang masuk ke websiteMengimplementasikan SEO yang baik di dalam website perusahaanMenerapkan praktik terbaik keamanan website berbasis WordPress.Melakukan deployment ke server live.Menggunakan sistem marketing otomatis untuk mengelola email pengunjung, database kontak dan distribusi emailMembimbing klien dalam proses pengalihan pengelolaan situs web.Mengidentifikasi dan menangani bug serta error.Memantau kinerja situs web dan melakukan pemeliharaan secara berkala.Berkolaborasi dengan pembuat kontenJob Requirements:Memiliki gelar S1 di jurusan teknik informatika atau computer scienceMemiliki pengalaman minimal 2 tahun dalam pembuatan websiteMenguasai HTML, CSS, Javascript, PHP, MySQL, Node.js, React.js, API Request dan WordpressMemiliki pemahaman dasar tentang desain web.Berpengalaman membuat antarmuka (UI/UX) untuk aplikasi Web / Desktop / MobileMenguasai pengimplementasian Search Engine Optimization (SEO)Mengerti penggunaan tool analisa seperti Google Analytics, Google Tag ManagerFamiliar dengan berbagai macam WordPress page builder, plugin, dan kustomisasi tema WordPress.Memiliki pemahaman yang baik tentang arsitektur WordPress multisite.Mampu melakukan integrasi dengan layanan web pihak ketiga terkait pemantauan server, analisis trafik, dan keamanan web.Pengalaman dengan WooCommerce, dan mampu melakukan integrasi dengan layanan pembayaran online dan pengiriman barang adalah nilai tambah.Kemampuan bekerja baik secara mandiri maupun dalam tim."
  },
  {
    "job_title": "Full Stack React Native Developers (Full Remote)",
    "company_name": "DevStack",
    "location": "Bandung, Jawa Barat",
    "employement": "Full time",
    "salary": "Rp 15.000.000 – Rp 22.000.000 per month",
    "job_description": "Job ResponsibilitiesDevelop and maintain high-quality React Native applications for both iOS and Android.Develop and maintain the back-end engine using C#.Collaborate with cross-functional teams to define, design, and ship new features.Ensure the performance, quality, and responsiveness of applications.Identify and correct bottlenecks and fix bugs.Continuously discover, evaluate, and implement new technologies to maximize development efficiency.Technical RequirementsSpeak fluent English.Minimum of 3+ years of relevant experience in mobile app development using React Native.Minimum of 3+ years of relevant experience using C# for API or back-end development.Familiarity on using Expo for React Native.Strong knowledge of iOS and Android development.Experience with RESTful APIs, third-party libraries, and SDKs.Familiarity with cloud computing process and terms.Solid understanding of the full mobile development life cycle.Excellent problem-solving skills and attention to details.Strong communication and teamwork skills.Before applying, please make sure to update your CV in English and make it clear about your experience and tech stack you have experience with.Only shortlisted candidates who qualified based on the requirement above will be contacted for further process. "
  },
  {
    "job_title": "Fullstack Developer",
    "company_name": "PT. Sasmita Wikrama Nusantara",
    "location": "Jakarta Selatan, Jakarta Raya",
    "employement": "Kontrak",
    "salary": "Rp 5,000,000 – Rp 7,500,000 per month",
    "job_description": "Full Stack Developer Job Description TemplateWe are looking for a skilled computer programmer who is comfortable with both front and back end programming. Full stack developers are responsible for developing and designing front end web architecture, ensuring the responsiveness of applications, and working alongside graphic designers for web design features, among other duties.Full stack developers will be required to see out a project from conception to final product, requiring good organizational skills and attention to detail.Full Stack Developer Responsibilities:Developing front end website architecture.Designing user interactions on web pages.Developing back-end website applications.Creating servers and databases for functionality.Ensuring cross-platform optimization for mobile phones.Ensuring responsiveness of applications.Working alongside graphic designers for web design features.Seeing through a project from conception to finished product.Designing and developing APIs.Meeting both technical and consumer needs.Staying abreast of developments in web applications and programming languages.Full Stack Developer Requirements:Degree in computer science or engineering.Strong organizational and project management skills.Experience in professional programming more than 1 yearProficiency with fundamental front-end languages such as HTML, CSS, and JavaScript.Familiarity with JavaScript frameworks such as Angular JS, React, or Amber.Proficiency with server-side languages such as Python, Java, PHP, Node.js, or .Net.Familiarity with database technology such as MySQL, PostGreSQL, MSSQL, and MongoDB.Excellent verbal communication skills.Good problem-solving skills.Attention to detail. "
  },
  {
    "job_title": "Back end Developer",
    "company_name": "Pengiklan Anonim",
    "location": "Back end DeveloperPengiklan AnonimKabupaten Malang, Jawa Timur",
    "employement": "Full time",
    "salary": "Rp 7,000,000 – Rp 8,500,000 per month",
    "job_description": "This is a full-time hybrid role as a Back End Developer at a newly established  start up founded by a large national data center company in Indonesia.The Back End Developer will be responsible for day-to-day tasks related to back-end web development, software development, and object-oriented programming (OOP). The role is located in Malang and allows for some remote work flexibility in a week.Qualifications:Back-End Web Development, Software Development, and Object-Oriented Programming (OOP) skillsFront-End Development and Programming skillsExperience in creating scalable and efficient web applicationsStrong problem-solving and analytical skillsKnowledge of web development frameworks and librariesExperience with database management systemsProficiency in programming languages such as Java, Python, or RubyStrong collaboration and teamwork abilitiesExcellent communication and interpersonal skillsBachelor's degree in Computer Science or a related field2 years working experience in similar role is an advantage "
  },
  {
    "job_title": "Backend Engineer",
    "company_name": "PT. Fore Kopi Indonesia",
    "location": "Jakarta Raya",
    "employement": "Full time",
    "salary": 0,
    "job_description": "Membuat mengelola dan mengintegrasikan database\nMembangun aplikasi dengan framework back end sesuai dengan roadmap \nIntegrasi API dan cloud computing\nBekerja dengan sistem operasi android, ios, linus dan windows\nMengelola dan mengembangkan content management system (CMS)Pengaturan keamanan dan pencegahan peretasan\nMembuat laporan berkal terkait progress, analisis dan statistikMINIMUM REQUIREMENTSS1 jurusan teknologi informasi, computer science, sistem informasi\nMudah beradaptasi dengan sistem hybrid dan agile methodologyPengalaman minimal 3 tahun dibidangnya\nMemahami bahasa pemrograman BE dan database (Sql, Mysql, NodeJS, NextJS)\nMemahami struktur query dan database dengan baik \nMemahami proses analisa, fine tuning dan optimisasi database"
  },
  {
    "job_title": "Software Engineer - Backend",
    "company_name": "PT Trinusa Travelindo",
    "location": "Software Engineer - BackendPT Trinusa Travelindo4.328 ulasan·Lihat semua lowongan kerjaJakarta Raya",
    "employement": "Full time",
    "salary": 0,
    "job_description": "It's fun to work in a company where people truly BELIEVE in what they're doing!\n‎ \n‎ \nJob Description\nOur team is seeking an passionate Backend Software Engineer to join us as we create and deliver mission critical services and processes to enable Traveloka Experience. \nAs a Backend Software Engineer, you will have the opportunity to design and develop creative, compelling, and maintain highly available systems that serve millions of Traveloka users every day. You will develop software and services at scale, innovating on the latest technologies as the earliest adopters while employing your knowledge in algorithms, design patterns, and data structures to solve our customers' needs. \nIn addition to collaborating with fellow engineers, Product Managers, Operations, and Designers, you will be working in an open environment where there are no boundaries or power distances, and are expected to ask questions, speak your mind, and continuously learn and grow. \nAs a Backend Software Engineer, you are expected to: \n\nBe responsible for designing, building, improving, or maintaining our backend applications, third-party data integration, data API, backend systems, or working with monitoring tools and infrastructure \nContribute code to projects that require backend work \nImprove existing code bases to be more scalable and reliable \nMonitor and react on alerts to resolve issues \nConsider testability, portability/monitoring, reliability, and maintainability, and understand when code is ready to be shared and delivered \nPropose solutions to code or problems in a high-traffic environment Perform analysis exercises and contribute to postmortems for incidents \nWork in cross-functional teams and meet great people regularly from top tier technology, consulting, product, or academic background \nParticipate and contribute to engineering hygiene such as code review, unit testing, integration testing, and architectural design review \nBe encouraged to speak your mind, propose ideas, influence others, and continuously grow yourself\n\n‎ \nRequirements\n\nBachelors' degree in Computer Science from reputable universities s preferred. \nExcellent problem solving by employing algorithms, data structures, and design patterns \nWillingness to continuously learn new things in assigned team: technology-related, product-related, or others \nStrong sense of ownership and belonging to the product(s) owned by the team, and to the tasks at hand \nFluency with English, both oral and written \nPrior technical engineering or working experience is a plus\n\n‎ \nIf you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!"
  },
  {
    "job_title": "Junior Backend Developer",
    "company_name": "PT. HTC Global Software Services",
    "location": "Jakarta Raya",
    "employement": "Kontrak",
    "salary": "Rp 5.000.000 – Rp 6.000.000 per month",
    "job_description": "Key Responsibilities:Develop and maintain backend services and APIs.Collaborate with frontend developers to integrate user-facing elements with server-side logic.Write clean, maintainable, and efficient code.Implement security and data protection measures.Optimize applications for maximum speed and scalability.Debug and resolve technical issues.Participate in code reviews and provide constructive feedback.Assist in the design and implementation of database schemas.Qualifications:Bachelor’s degree in Computer Science, Engineering, or a related field.1-3 years of experience in Spring/Spring Boot Framework.Experience with Microservices development.Experience with databases such as MySQL, PostgreSQL, MongoDB, or similar.Experience with deployment using CI/CD (Jenkins/Gitlab CI).Strong problem-solving skills and attention to detail.Ability to work collaboratively in a team environment.Willing to work in Banking Industry is a must."
  },
  {
    "job_title": "IT Back-end Developer (Project Based)",
    "company_name": "PT Aneka Search Indonesia",
    "location": "Setiabudi, Jakarta Raya",
    "employement": "Kontrak",
    "salary": 0,
    "job_description": "Bersedia untuk Work From Office & Menjalani Kontrak Kerja selama 3 BulanDeskripsi Pekerjaan:Membuat modul backend yang efisien dengan bahasa pemrograman PHPMenguji dan mengevaluasi modul dan fungsi yang dibuatMengatasi masalah dan gangguan pada opeasional aplikasiBerpatisipasi aktif dalam tim developerMengintegrasikan layanan-layanan yang dikembangkanBerorientasi untuk mengembangkan aplikasi berbasis web yang kompleksMempertahankan dan meningkatkan performa basis kode yang adaMemberikan solusi pemecahan masalah bug dan menambahkan fitur baruPengelolaan data dan dokumen pada proses di dalam aplikasi sesuai kebutuhanMengintegrasikan elemen yang dipakai user dengan elemen yang dkembangkan oleh Front-end DveloperKualifikasi:Pendidikan minimal S1 Sistem Informasi / Teknologi InformasiMemiliki pengalaman 2 sampai 3 TahunMenguasai RDBMSMenguasai PHP 7+Familiar dengan ORM Laravel / EloquentFamiliar dengan RESTful APIs.Familiar dengan postman/ swaggerMengerti git repository "
  },
  {
    "job_title": "Software Engineer- Backend",
    "company_name": "NETMEDIAS LEASHARES SDN. BHD.",
    "location": "Tangerang, Banten",
    "employement": "Full time",
    "salary": "Rp 11,000,000 – Rp 16,000,000 per month",
    "job_description": "ResponsibilitiesCollaborate with the development team to contribute to the design and implementation of backend systems while adhering to best practices.Support cloud operations on AWS under the guidance of senior team members for reliable and scalable backend systems.Work closely with front-end developers, business development, and business partners to integrate APIs for mobile billing applications.Develop and maintain code following established coding standards and guidelines.Assist in building and updating technical documentation.Provide regular updates on work progress to the team.Actively participate in continuous learning opportunities to enhance software development skills.QualificationsDegree in Computer Science, Computer Engineering, or related field.Good command of the English language is a must.Has 3 years of experience as a backend developer Knowledge of backend development concepts.Has 3 years of experience with Python.Basic understanding of REST APIs.Strong problem-solving skills and an eagerness to learn from experienced team members.Effective communication skills, both written and verbal.Ability to work collaboratively in a team environment.Eagerness to explore and adopt new technologies. Desired Skills (not mandatory)Familiarity with non-relational databases such as MongoDB, DocumentDB, or CosmosDB.Basic understanding of relational databases such as MySQL, PostgreSQL, or MSSQL.Familiarity with version control systems (e.g., Git). Work location will be located at Tangerang, Banten"
  },
  {
    "job_title": "Fullstack Developer Mobile & Backend (Project Based)",
    "company_name": "COMBIPHAR Group",
    "location": "Jakarta Raya",
    "employement": "Full time",
    "salary": 0,
    "job_description": "Pendidikan minimal S1 jurusan Ilmu Komputer, Teknologi Informasi, Sistem Informasi atau program studi yang berkaitanMemilki pengalaman kerja minimal 5 tahun pada posisi terkait Menguasai dan memiliki pengalaman mengembangkan aplikasi AndroidMenguasai teknologi yang berhubungan dengan API .NET seperti: C#, ASP.NET, MVC, API, HTMLMenguasai SQL Server seperti produce, Function, Type Trigger, Agent NOT SMOKINGProject Based (6 Months)Bersedia full WFO di Office 8, Senopati, Jakarta Selatan"
  },
  {
    "job_title": "IT BACKEND DEVELOPER",
    "company_name": "PT PESONNA OPTIMA JASA",
    "location": "Jakarta Pusat, Jakarta Raya",
    "employement": "Kontrak",
    "salary": 0,
    "job_description": "Deskripsi Pekerjaan:Menguasai Java dan Golang;Memahami dan menggunakan Version Control tools (GitHub, GitLab);Persyaratan:Usia Maksimal 30 Tahun;Minimal D3 dari Jurusan Teknik Informatika, Sistem Informatika, Teknik Komputer, Manajemen Informatika, Teknik Elektro, Matematika, atau Statistik;IPK minimal 2,75;Memiliki pengalaman sebagai Back End/Middleware/Proyek Pengembangan Aplikasi minimal 1 (satu) tahun;Aktif dan mempunyai kemampuan belajar dengan cepat;Dapat bekerja secara mandiri tanpa pengawasan maupun bekerjasama dalam kelompok;Mampu bekerja di bawah tekanan dan deadline;Mampu berkomunikasi dengan baik, baik dalam Bahasa Indonesia maupun Inggris;Bersedia Full WFO di kantor PT Pegadaian (Jl. Salemba Raya No. 2 Jakarta Pusat). Nilai tambah bagi yang memiliki keahlian:Menguasai / memahami Database NoSQL (MongoDB);Menguasai / memahami Phyton;Memahami dan dapat mengimplementasikan CI/CD, Secure Coding dan Design Pattern;Paham Agile Method;Menguasai / memahami pembuatan aplikasi untuk API / Services;Menguasai / memahami API Management;Menguasai / memahami Microservices;Menguasai / memahami Operating System Linux, AIX, Windows Server;Menguasai / memahami Virtualisasi VMWare, Virtualbox;Menguasai / memahami penggunaan containerize (Docker);Memahami konsep queueing dan message broker (salah satu dari ActiveMQ, RabbitMQ, Kafka, dsb)."
  },
  {
    "job_title": "Back End Developer",
    "company_name": "PT UangMe Fintek Indonesia",
    "location": "Jakarta Selatan, Jakarta Raya",
    "employement": "Full time",
    "salary": 0,
    "job_description": "Job Descriptions:Develop and maintain server-side logic for web applications using Java, Golang, and PHP.Handle user authentication, database management, and data processing tasks.Collaborate with front-end developers to ensure seamless communication between server and user interface.Familiar with the software development life cycle (SDLC) from preliminary system analysis to tests and deployment.Troubleshoot and optimize application performance for smooth operation.Create robust and high-performing web applications that meet user and client requirements.Requirements:2 - 7 years of experience as a Software Engineer or Software DeveloperBachelor degree in Computer Science, Engineering or relevant fieldHave good programming skills and be familiar with some simple algorithmsFamiliar with Linux server and some simple instructionsFamiliar with database MySQL operations and able to write some basic query SQL statementsAbility to develop software in Java, Golang, PHPProficient in using code collaboration tools such as GitLabHave good English communication skills"
  },
  {
    "job_title": "Java Backend Developer",
    "company_name": "PT Cashlez Worldwide Indonesia",
    "location": "Jakarta Pusat, Jakarta Raya",
    "employement": "Full time",
    "salary": 0,
    "job_description": "Job qualification:Degree in Computer Science, Information Technology or related field of studyMinimum of 3 years of experience in development using Spring frameworkExperienced in Java Spring Boot, ISO Messaging 8583 and CI/CD with JenkinsExperienced in database and systems version control, such as Github or BitbucketExperienced with  cloud platforms (AWS, Google Cloud, atau Azure).Knowledge of REST web servicesGood interpersonal and communication skillProblem solver Responsibility:Participate in the entire application lifecycle.Write clean code to develop functional web services and APIsTroubleshoot and debug applications.Gather and address technical and design requirements.Liaise with developers, designers, and system administrators to identify new features"
  }
]